org/journal/2019-04-12.org
* 2019-04-12
** 14:51
   昨日、S chan とシャガットでワインを2本も飲んだので、11時ぐらいに帰ってきてそのまま寝てしまった。
   そのせいか、朝4時ぐらいに起きてしまって、8時ぐらいまでダラダラしたり、朝食をとったり、家事をしたり。
   その後、2時間ほど寝ようと思ったけど、スマホで気になることを調べてたら、9時ぐらいになってしまった。
   1時間でも寝ようとおもって寝たら、2時間も寝てしまった。
   まあ、そんなものだろうと思う。
   お腹にハリがあるのは昨日飲んだせいだと思うけど、そのせいかお腹が減らない。
   それでも、トリの胸肉とほうれん草をお昼に食べた。
   org から gcal に以降して、まだまだ慣れない。
   とにかくサッとメモを取る環境をスマホでは google task に PC では org-capture にしたけども、そういう風に分けるのもイヤだったりする。
   あと時間計測はやっぱりgcalだとうまくいかない。
   toggl という便利っぽいツールをみつけたので試してみたいところだけど、どうだろうか。
   toggl が非常に使えるなら、gcal すらいらなくなるような予感もするけど、家族とのスケジュール共有には gcal が必要だ。
   だから、gcal toggl 連携をしなければならないけど、そうやってツールに依存し続けるのもイヤだなあというところ。
   特に Web サービスはいきなり終了したり、仕様が変わったりするので、そのあたりが将来困りそう。
   それと、すべてをスケジュールするのは難しいのではないかという感じもしてきている。
   5分ぐらいで終るものもあるので、junk task という時間を設けてみたが、これもどうでるか。
   あまりいい未来はまってなさそうだけど、もう暫く続けることにする。
   今日はこれから床屋さん。
   夕飯の準備は終っているので。
   junk task も片づけたいところ。
