docs/journal/2019-04-12.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2025-01-19 日 16:28 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="author" content="clothoid" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org1d704ea">1. 2019-04-12</a>
<ul>
<li><a href="#org4b614e0">1.1. 14:51</a></li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-org1d704ea" class="outline-2">
<h2 id="org1d704ea"><span class="section-number-2">1.</span> 2019-04-12</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-org4b614e0" class="outline-3">
<h3 id="org4b614e0"><span class="section-number-3">1.1.</span> 14:51</h3>
<div class="outline-text-3" id="text-1-1">
<p>
昨日、S chan とシャガットでワインを2本も飲んだので、11時ぐらいに帰ってきてそのまま寝てしまった。
そのせいか、朝4時ぐらいに起きてしまって、8時ぐらいまでダラダラしたり、朝食をとったり、家事をしたり。
その後、2時間ほど寝ようと思ったけど、スマホで気になることを調べてたら、9時ぐらいになってしまった。
1時間でも寝ようとおもって寝たら、2時間も寝てしまった。
まあ、そんなものだろうと思う。
お腹にハリがあるのは昨日飲んだせいだと思うけど、そのせいかお腹が減らない。
それでも、トリの胸肉とほうれん草をお昼に食べた。
org から gcal に以降して、まだまだ慣れない。
とにかくサッとメモを取る環境をスマホでは google task に PC では org-capture にしたけども、そういう風に分けるのもイヤだったりする。
あと時間計測はやっぱりgcalだとうまくいかない。
toggl という便利っぽいツールをみつけたので試してみたいところだけど、どうだろうか。
toggl が非常に使えるなら、gcal すらいらなくなるような予感もするけど、家族とのスケジュール共有には gcal が必要だ。
だから、gcal toggl 連携をしなければならないけど、そうやってツールに依存し続けるのもイヤだなあというところ。
特に Web サービスはいきなり終了したり、仕様が変わったりするので、そのあたりが将来困りそう。
それと、すべてをスケジュールするのは難しいのではないかという感じもしてきている。
5分ぐらいで終るものもあるので、junk task という時間を設けてみたが、これもどうでるか。
あまりいい未来はまってなさそうだけど、もう暫く続けることにする。
今日はこれから床屋さん。
夕飯の準備は終っているので。
junk task も片づけたいところ。
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: clothoid</p>
<p class="date">Created: 2025-01-19 日 16:28</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
